app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("created_at", "email", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 15 Jun 2013 16:00:41 UTC +00:00], ["email", ""], ["name", "crowdarmor"], ["provider", "twitter"], ["uid", "1519626841"], ["updated_at", Sat, 15 Jun 2013 16:00:41 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '1519626841' LIMIT 1